{"notes": "Includes bibliographical references and index.\n\nCh. 1. Introduction -- Ch. 2. Principles of Algorithm Analysis -- Ch. 3. Elementary Data Structures -- Ch. 4. Abstract Data Types -- Ch. 5. Recursion and Trees --Ch. 6. Elementary Sorting Methods -- Ch. 7. Quicksort -- Ch. 8. Mergesort -- Ch. 9. Priority Queues and Heapsort -- Ch. 10. Radix Sorting -- Ch. 11. Special-Purpose Sorts -- Ch. 12. Symbol Tables and BSTs -- Ch. 13. Balanced Trees -- Ch. 14. Hashing --Ch. 15. Radix Search -- Ch. 16. External Searching.", "isbn10": "0201314525", "urls_text": "", "publisher_name": "Addison-Wesley", "topic": "algorithms", "dewey_normal": "5.133", "publisher_id": "addison_wesley", "category": "theory", "language": "eng", "dewey_decimal": "005.13/3", "title_long": "", "publisher_text": "Reading, Mass. : Addison-Wesley, c1998-<c2002   >", "summary": "Robert Sedgewick has thoroughly rewritten and substantially expanded his popular work to provide current and comprehensive coverage of important algorithms and data structures. Many new algorithms are presented, and the explanations of each algorithm are much more detailed than in previous editions. A new text design and detailed, innovative figures, with accompanying commentary, greatly enhance the presentation. The third edition retains the successful blend of theory and practice that has made Sedgewick's work an invaluable resource for more than 250,000 programmers! Whether you are a student learning the algorithms for the first time or a professional interested in having up-to-date reference material, you will find a wealth of useful information in this book.", "book_id": "algorithms_in_c_a03", "copies": 1, "awards_text": "", "marc_enc_level": "", "edition_info": "(v. 1)", "subject_ids": ["c_computer_program_language", "computer_algorithms"], "lcc_number": "QA76.73", "isbn13": "9780201314526", "physical_description_text": "<v. 1-2; in 5   > : ill. ; 24 cm.", "title_latin": "Algorithms in C", "author_data": [{"name": "Sedgewick, Robert", "id": "sedgewick_robert"}], "title": "Algorithms in C", "shelf": "4.4"}