{"notes": "", "isbn10": "0071635351", "urls_text": "", "publisher_name": "McGraw-Hill", "topic": "math", "dewey_normal": "371", "publisher_id": "mcgraw_hill", "category": "other subjects", "language": "", "dewey_decimal": "371", "title_long": "Schaum's Outline of Beginning Calculus, Third Edition (Schaum's Outline Series)", "publisher_text": "McGraw-Hill", "summary": "Confusing Textbooks? Missed Lectures? Tough Test Questions? Fortunately for you, there's Schaum's Outlines. More than 40 million students have trusted Schaum's to help them succeed in the classroom and on exams. Schaum's is the key to faster learning and higher grades in every subject. Each Outline presents all the essential course information in an easy-to-follow, topic-by-topic format. You also get hundreds of examples, solved problems, and practice exercises to test your skills. This Schaum's Outline gives you: Practice problems with full explanations that reinforce knowledge Coverage of the most up-to-date developments in your course field In-depth review of practices and applications Fully compatible with your classroom text, Schaum's highlights all the important facts you need to know. Use Schaum's to shorten your study time-and get your best test scores! Schaum's Outlines-Problem Solved.", "book_id": "schaums_outline_of_beginning_calculus_third_edition", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2009-08-24", "subject_ids": ["professional_technical_professional_science_mathematics_math", "professional_technical_professional_science_mathematics_pure", "reference_study_guides", "science_mathematics_mathematical_analysis", "science_mathematics_pure_mathematics_calculus"], "lcc_number": "", "isbn13": "9780071635356", "physical_description_text": "8.1\"x10.7\"x0.8\"; 1.1 lb; 416 pages", "title_latin": "Schaum's Outline of Beginning Calculus, Third Edition", "author_data": [{"name": "Mendelson, Elliott", "id": "mendelson_elliott"}], "title": "Schaum's Outline of Beginning Calculus, Third Edition", "shelf": "3.3"}