{"notes": "", "isbn10": "0132783398", "urls_text": "", "publisher_name": "Addison Wesley", "topic": "web", "dewey_normal": "6.74", "publisher_id": "addison_wesley_a01", "category": "platforms", "language": "", "dewey_decimal": "006.74", "title_long": "Web Development and Design Foundations with HTML5 (6th Edition)", "publisher_text": "Addison Wesley", "summary": "Using Hands-On Practice exercises and Website Case Studies to motivate readers, Web Development and Design Foundations with HTML5 includes all the necessary lessons to guide students in developing highly effective websites. This textbook has an innovative approach that prepares students to design web pages that work today, in addition to being ready to take advantage of the new HTML5 coding techniques of the future. XHTML syntax is introduced, but the focus is on HTML5 syntax. New HTML5 elements are presented, with an emphasis on coding web pages that work in both current and future browsers. A well-rounded balance of hard skills (HTML5, XHTML, CSS, and an introduction to JavaScript) and soft skills (web design, e-commerce overview, website promotion strategies) presents everything beginning web developers need to know to build and promote successful websites. Topics include: Internet concepts Creating web pages with HTML5 Configuring text, color, and page layout with CSS HTML5 Video and Audio HTML5 Form Controls New CSS3 properties Web design best practicesCSS media queriesDesigning web pages for mobile devices Web accessibility standards The web development process Choosing a domain name Selecting a web host Website promotion and search engine optimization E-commerce Overview JavaScript Introduction", "book_id": "web_development_and_design_foundations_with_html5", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2012-02-27", "subject_ids": ["computers_technology_programming_languages_tools_xhtml", "computers_technology_web_development_web_design", "education_reference"], "lcc_number": "", "isbn13": "9780132783392", "physical_description_text": "8.5\"x10.8\"x1.0\"; 2.7 lb; 672 pages", "title_latin": "Web Development and Design Foundations with HTML5", "author_data": [{"name": "Terry Felke-Morris", "id": "terry_felke_morris"}], "title": "Web Development and Design Foundations with HTML5", "shelf": "9.1"}