{"notes": "", "isbn10": "0195179986", "urls_text": "", "publisher_name": "Oxford University Press, USA", "topic": "science/social science", "dewey_normal": "920", "publisher_id": "oxford_university_press_usa", "category": "other subjects", "language": "", "dewey_decimal": "920", "title_long": "", "publisher_text": "Oxford University Press, USA", "summary": "For all but the most credit-worthy companies, it is more efficient to finance large pools of assets that have predictable behavioral characteristics through non-standard arrangements. These off-balance sheet structures allow credit exposures to be tailored to investor risk, asset class, and an ever-increasing diversity of idiosyncratic needs on the part of issuers and investors. The discipline that addresses these structures, which is called structured finance or securitization, is almost twenty years old, and has become a pervasive element of modern financial management. Yet, it has not been systematically covered in a textbook designed for both the school and workplace contexts. The Elements of Structured Finance, the text version of a program of instruction in structured finance that the authors have offered at NYU and Hong Kong University, as well as in private training programs and consultancies, fills this void spectacularly. Raynes and Rutledge, two very highly regarded teachers and consultants in the field, bring clarity and logic to an inherently complex and frightening area of finance, using their extensive experience working with many of the top Wall Street securities houses. The book begins with the relatively simple concepts of static valuation models and the benchmark pool, and takes the reader through the more esoteric features of dynamic risk analysis, thus serving as both an introduction for the beginner and a helpful reference for the professional. In addition to participants in structured finance programs, this book will appeal to structured finance analysts and managers at banks, asset management companies, insurance companies, and a wide variety of other corporations.", "book_id": "the_elements_of_structured_finance", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Hardcover; 2010-01-28", "subject_ids": ["biographies_memoirs_general", "business_investing_finance_general", "business_investing_investing_general", "professional_technical_accounting_finance_finance_general"], "lcc_number": "", "isbn13": "9780195179989", "physical_description_text": "704 pages", "title_latin": "The Elements of Structured Finance", "author_data": [{"name": "Ann Rutledge", "id": "ann_rutledge"}, {"name": "Sylvain Raines", "id": "sylvain_raines"}], "title": "The Elements of Structured Finance", "shelf": "1.3"}