{"notes": "", "isbn10": "098478280X", "urls_text": "", "publisher_name": "CareerCup", "topic": "interview", "dewey_normal": "0", "publisher_id": "careercup", "category": "jobs", "language": "", "dewey_decimal": "", "title_long": "Cracking the Coding Interview: 150 Programming Questions and Solutions", "publisher_text": "CareerCup", "summary": "Now in the 5th edition, Cracking the Coding Interview gives you the interview preparation you need to get the top software developer jobs. This is a deeply technical book and focuses on the software engineering skills to ace your interview. The book is over 500 pages and includes 150 programming interview questions and answers, as well as other advice. The full list of topics are as follows:The Interview ProcessThis section offers an overview on questions are selected and how you will be evaluated. What happens when you get a question wrong? When should you start preparing, and how? What language should you use? All these questions and more are answered.Behind the ScenesLearn what happens behind the scenes during your interview, how decisions really get made, who you interview with, and what they ask you. Companies covered include Google, Amazon, Yahoo, Microsoft, Apple and Facebook.Special SituationsThis section explains the process for experience candidates, Program Managers, Dev Managers, Testers / SDETs, and more. Learn what your interviewers are looking for and how much code you need to know.Before the InterviewIn order to ace the interview, you first need to get an interview. This section describes what a software engineer's resume should look like and what you should be doing well before your interview.Behavioral PreparationAlthough most of a software engineering interview will be technical, behavioral questions matter too. This section covers how to prepare for behavioral questions and how to give strong, structured responses.Technical Questions (+ 5 Algorithm Approaches)This section covers how to prepare for technical questions (without wasting your time) and teaches actionable ways to solve the trickiest algorithm problems. It also teaches you what exactly \"good coding\" is when it comes to an interview.150 Programming Questions and AnswersThis section forms the bulk of the book. Each section opens with a discussion of the core knowledge and strategies to tackle this type of question, diving into exactly how you break down and solve it. Topics covered include Arrays and StringsLinked ListsStacks and QueuesTrees and GraphsBit ManipulationBrain TeasersMathematics and ProbabilityObject-Oriented DesignRecursion and Dynamic ProgrammingSorting and SearchingScalability and Memory LimitsTestingC and C++JavaDatabasesThreads and LocksFor the widest degree of readability, the solutions are almost entirely written with Java (with the exception of C / C++ questions). A link is provided with the book so that you can download, compile, and play with the solutions yourself. Changes from the Fourth Edition: The fifth edition includes over 200 pages of new content, bringing the book from 300 pages to over 500 pages. Major revisions were done to almost every solution, including a number of alternate solutions added. The introductory chapters were massively expanded, as were the opening of each of the chapters under Technical Questions. In addition, 24 new questions were added.Cracking the Coding Interview, Fifth Edition is the most expansive, detailed guide on how to ace your software development / programming interviews.", "book_id": "cracking_the_coding_interview_a01", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2011-08-22", "subject_ids": ["business_investing_job_hunting_careers_interviewing", "computers_technology_programming_software_design_testi_aaaa0"], "lcc_number": "", "isbn13": "9780984782802", "physical_description_text": "6.0\"x8.9\"x1.3\"; 1.5 lb; 508 pages", "title_latin": "Cracking the Coding Interview", "author_data": [{"name": "Gayle Laakmann McDowell", "id": "gayle_laakmann_mcdowell"}], "title": "Cracking the Coding Interview", "shelf": "9.4"}