{"notes": "", "isbn10": "0060593083", "urls_text": "", "publisher_name": "Harper Perennial", "topic": "fiction", "dewey_normal": "0", "publisher_id": "harper_perennial", "category": "fiction", "language": "", "dewey_decimal": "", "title_long": "Quicksilver (The Baroque Cycle, Vol. 1)", "publisher_text": "Harper Perennial", "summary": "In Quicksilver, the first volume of the \"Baroque Cycle,\" Neal Stephenson launches his most ambitious work to date. The novel, divided into three books, opens in 1713 with the ageless Enoch Root seeking Daniel Waterhouse on the campus of what passes for MIT in eighteenth-century Massachusetts. Daniel, Enoch's message conveys, is key to resolving an explosive scientific battle of preeminence between Isaac Newton and Gottfried Wilhelm Leibniz over the development of calculus. As Daniel returns to London aboard the Minerva, readers are catapulted back half a century to recall his years at Cambridge with young Isaac. Daniel is a perfect historical witness. Privy to Robert Hooke's early drawings of microscope images and with associates among the English nobility, religious radicals, and the Royal Society, he also befriends Samuel Pepys, risks a cup of coffee, and enjoys a lecture on Belgian waffles and cleavage-?all before the year 1700. In the second book, Stephenson introduces Jack Shaftoe and Eliza. \"Half-Cocked\" Jack (also know as the \"King of the Vagabonds\") recovers the English Eliza from a Turkish harem. Fleeing the siege of Vienna, the two journey across Europe driven by Eliza's lust for fame, fortune, and nobility. Gradually, their circle intertwines with that of Daniel in the third book of the novel. The book courses with Stephenson's scholarship but is rarely bogged down in its historical detail. Stephenson is especially impressive in his ability to represent dialogue over the evolving worldview of seventeenth-century scientists and enliven the most abstruse explanation of theory. Though replete with science, the novel is as much about the complex struggles for political ascendancy and the workings of financial markets. Further, the novel's literary ambitions match its physical size. Stephenson narrates through epistolary chapters, fragments of plays and poems, journal entries, maps, drawings, genealogic tables, and copious contemporary epigrams. But, caught in this richness, the prose is occasionally neglected and wants editing. Further, anticipating a cycle, the book does not provide a satisfying conclusion to its 900 pages. These are minor quibbles, though. Stephenson has matched ambition to execution, and his faithful, durable readers will be both entertained and richly rewarded with a practicum in Baroque science, cypher, culture, and politics. --Patrick O'Kelley", "book_id": "quicksilver_a10", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2004-10-01", "subject_ids": [], "lcc_number": "", "isbn13": "9780060593087", "physical_description_text": "960 pages", "title_latin": "Quicksilver", "author_data": [{"name": "Stephenson, Neal", "id": "stephenson_neal"}], "title": "Quicksilver", "shelf": "1.-1"}