{"notes": "", "isbn10": "059680170X", "urls_text": "", "publisher_name": "O'Reilly Media", "topic": "r", "dewey_normal": "5", "publisher_id": "oreilly_media", "category": "languages", "language": "", "dewey_decimal": "005", "title_long": "", "publisher_text": "O'Reilly Media", "summary": "R is one of the best tools available for data visualization and statistical computing, and this book is simply the best way to learn this open source language and environment. Practical and easy to read, R in a Nutshell demonstrates why R is increasingly popular for analyzing moderate-to-large data sets. Most books available on R are stiff and academic, but this Nutshell guide offers a readable overview of the language, and contains a reference for the most commonly used features. Learn the basics of the R language, such as syntax, expressions, and more Analyze statistics in R using statistical tests, modeling functions, and charts Discover R's graphical capabilities, including basic R graphics and lattice graphics Scientists, researchers, and students in a variety of disciplines -- from biology, chemistry, and physics to social sciences, engineering, and webinformatics for social networks, performance analysis, and more -- can perform complicated statistical analysis in minutes that would take hours with Excel. R in a Nutshell shows you how.", "book_id": "r_in_a_nutshell", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2010-01-04", "subject_ids": ["computers_internet_computer_science_modeling_simulation", "computers_internet_databases_database_design", "computers_internet_databases_data_mining", "computers_internet_software_mathematical_statistical", "computers_internet_general", "science_biological_sciences_bioinformatics"], "lcc_number": "", "isbn13": "9780596801700", "physical_description_text": "640 pages", "title_latin": "R in a Nutshell", "author_data": [{"name": "Adler Joseph", "id": "adler_joseph_a01"}], "title": "R in a Nutshell", "shelf": "7.4"}