{"notes": "Includes bibliographical references and index.\n\nIntroduction : the rise of the super crunchers -- Who's doing your thinking for you? -- Creating your own data with the flip of a coin -- Government by chance -- How should physicians treat evidence-based medicine? -- Experts vs. equations -- Why now? -- Are we having fun yet? -- The future of intuition (and expertise).", "isbn10": "0553805401", "urls_text": "Table of contents only http://www.loc.gov/catdir/toc/ecip0715/2007013804.html\n\nSample text http://www.loc.gov/catdir/enhancements/fy0743/2007013804-s.html\n\nPublisher description http://www.loc.gov/catdir/enhancements/fy0743/2007013804-d.html\n\nContributor biographical information http://www.loc.gov/catdir/enhancements/fy0743/2007013804-b.html", "publisher_name": "Bantam Books", "topic": "science/social science", "dewey_normal": "519.5", "publisher_id": "bantam_books", "category": "other subjects", "language": "eng", "dewey_decimal": "519.5", "title_long": "Super crunchers: why thinking-by-numbers is the new way to be smart", "publisher_text": "New York : Bantam Books, 2007.", "summary": "Gone are the days of solely relying on intuition to make decisions. Today, number crunching affects your life in ways you might never imagine. Economist Ian Ayres shows how today's organizations are analyzing massive databases at lightning speed to provide greater insights into human behavior. From Web sites like Google and Amazon that know your tastes, to a physician's diagnosis or your child's education, to boardrooms and government agencies, this new breed of decisionmakers are calling the shots. And they are delivering staggeringly accurate results. How can a football coach evaluate a player without ever seeing him play? How can a formula outpredict wine experts in determining the best vintages? Super crunchers have the answers. In this brave new world of equation versus expertise, Ayres shows us the benefits and risks, who loses and who wins, and how super crunching can be used to help, not manipulate us.--From publisher description.", "book_id": "super_crunchers", "copies": 1, "awards_text": "", "marc_enc_level": "", "edition_info": "(hardcover)", "subject_ids": ["statistics", "regression_analysis", "sampling_statistics", "standard_deviations"], "lcc_number": "HA29", "isbn13": "9780553805406", "physical_description_text": "260 p. : ill. ; 24 cm.", "title_latin": "Super crunchers", "author_data": [{"name": "Ayres, Ian", "id": "ayres_ian"}], "title": "Super crunchers", "shelf": "1.3"}