{"notes": "", "isbn10": "0262015773", "urls_text": "", "publisher_name": "The MIT Press", "topic": "applied", "dewey_normal": "6.370151", "publisher_id": "the_mit_press", "category": "ai", "language": "", "dewey_decimal": "006.370151", "title_long": "", "publisher_text": "The MIT Press", "summary": "This volume demonstrates the power of the Markov random field (MRF) in vision, treating the MRF both as a tool for modeling image data and, utilizing recently developed algorithms, as a means of making inferences about images. These inferences concern underlying image and scene structure as well as solutions to such problems as image reconstruction, image segmentation, 3D vision, and object labeling. It offers key findings and state-of-the-art research on both algorithms and applications. After an introduction to the fundamental concepts used in MRFs, the book reviews some of the main algorithms for performing inference with MRFs; presents successful applications of MRFs, including segmentation, super-resolution, and image restoration, along with a comparison of various optimization methods; discusses advanced algorithmic topics; addresses limitations of the strong locality assumptions in the MRFs discussed in earlier chapters; and showcases applications that use MRFs in more complex ways, as components in bigger systems or with multiterm energy functions. The book will be an essential guide to current research on these powerful mathematical tools.", "book_id": "markov_random_fields_for_vision_and_image_processing", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Hardcover; 2011-07-22", "subject_ids": ["computers_internet_computer_science_artificial_intelligence", "computers_internet_programming_algorithms", "computers_internet_programming_graphics_multimedia", "science_mathematics"], "lcc_number": "", "isbn13": "9780262015776", "physical_description_text": "7.0\"x9.1\"x1.1\"; 2.2 lb; 472 pages", "title_latin": "Markov Random Fields for Vision and Image Processing", "author_data": [{"name": "Blake, Andrew", "id": "blake_andrew"}, {"name": "Pushmeet Kohli", "id": "pushmeet_kohli"}, {"name": "Carsten Rother", "id": "carsten_rother"}], "title": "Markov Random Fields for Vision and Image Processing", "shelf": "7.3"}