{"notes": "", "isbn10": "026251298X", "urls_text": "", "publisher_name": "The MIT Press", "topic": "scheme", "dewey_normal": "5.133", "publisher_id": "the_mit_press", "category": "languages", "language": "", "dewey_decimal": "005.133", "title_long": "", "publisher_text": "The MIT Press", "summary": "Scheme is a general-purpose programming language, descended from Algol and Lisp, widely used in computing education and research and a broad range of industrial applications. This thoroughly updated edition of The Scheme Programming Language provides an introduction to Scheme and a definitive reference for standard Scheme, presented in a clear and concise manner. Written for professionals and students with some prior programming experience, it begins by leading the programmer gently through the basics of Scheme and continues with an introduction to some of the more advanced features of the language. The fourth edition has been substantially revised and expanded to bring the content up to date with the current Scheme standard, the Revised6 Report on Scheme. All parts of the book were updated and three new chapters were added, covering the language's new library, exception handling, and record-definition features. The book offers three chapters of introductory material with numerous examples, eight chapters of reference material, and one chapter of extended examples and additional exercises. All of the examples can be entered directly from the keyboard into an interactive Scheme session. Answers to many of the exercises, a complete formal syntax of Scheme, and a summary of forms and procedures are provided in appendixes. The Scheme Programming Language is the only book available that serves both as an introductory text in a variety of courses and as an essential reference for Scheme programmers.", "book_id": "the_scheme_programming_language_4th_edition", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2009-09-30", "subject_ids": ["computers_internet_programming_languages_tools_general", "computers_internet_programming_languages_tools_general_aas", "computers_internet_programming_general", "computers_internet_programming_general_aas"], "lcc_number": "", "isbn13": "9780262512985", "physical_description_text": "6.9\"x9.0\"x1.0\"; 1.6 lb; 512 pages", "title_latin": "The Scheme Programming Language, 4th Edition", "author_data": [{"name": "Dybvig, R. Kent", "id": "dybvig_r_kent"}], "title": "The Scheme Programming Language, 4th Edition", "shelf": "5.4"}