{"notes": "", "isbn10": "0671023233", "urls_text": "", "publisher_name": "Pocket", "topic": "history/geography", "dewey_normal": "0", "publisher_id": "pocket", "category": "other subjects", "language": "", "dewey_decimal": "", "title_long": "", "publisher_text": "Pocket", "summary": "One of the most unforgettable moments of my youth was learning the word pneumonoultramicroscopicsilicovolcanoconiosis. I was in third grade. So what if Richard Lederer has come up with a chemical compound that consists of 1,913 letters? Owning a word like pneumonoultramicroscopicsilicovolcanoconiosis is empowering at any age. If you have ever been completely wowed by the power you can have over language, or its power over you, Richard Lederer is your patron saint. His oft-reprinted introduction to Crazy English, which was originally published in 1989, claims that English is \"the most loopy and wiggy of all tongues.\" And then he demonstrates: \"In what other language do people drive in a parkway and park in a driveway? ... Why do they call them apartments when they're all together?\" And so on. Lederer's pace is frenetic. He alights on oxymorons (\"pretty ugly,\" \"computer jock\"), redundancies, confusing words (are you sure you know the meaning of enormity?), phobias, contronyms, heteronyms, retroactive terms (acoustic guitar, rotary phone), and a host of other linguistic delights. Though English may be one of the crazier languages--Lederer claims that about 80 percent of our words are not spelled phonetically--they are all, he says, a little crazy. \"That's because language is invented ... by boys and girls and men and women, not computers. As such, language reflects the creative and fearful asymmetry of the human race, which, of course, isn't really a race at all.\" --Jane Steinberg", "book_id": "crazy_english_a01", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 1998-06-01", "subject_ids": ["amazon_com_entertainment_humor_general", "amazon_com_reference_words_language_general", "amazon_com_nonfiction_education_reference_general", "amazon_com_reference_general"], "lcc_number": "", "isbn13": "9780671023232", "physical_description_text": "5.3\"x8.2\"x0.6\"; 224 pages; 0.4 lb", "title_latin": "CRAZY ENGLISH", "author_data": [{"name": "Lederer, Richard", "id": "lederer_richard"}], "title": "CRAZY ENGLISH", "shelf": "1.2"}