{"notes": "", "isbn10": "0596808321", "urls_text": "", "publisher_name": "O'Reilly Media", "topic": "got to go", "dewey_normal": "5", "publisher_id": "oreilly_media", "category": "stack", "language": "", "dewey_decimal": "005", "title_long": "Making Software: What Really Works, and Why We Believe It", "publisher_text": "O'Reilly Media", "summary": "Many claims are made about how certain tools, technologies, and practices improve software development. But which claims are verifiable, and which are merely wishful thinking? In this book, leading thinkers such as Steve McConnell, Barry Boehm, and Barbara Kitchenham offer essays that uncover the truth and unmask myths commonly held among the software development community. Their insights may surprise you. Are some programmers really ten times more productive than others? Does writing tests first help you develop better code faster? Can code metrics predict the number of bugs in a piece of software? Do design patterns actually make better software? What effect does personality have on pair programming? What matters more: how far apart people are geographically, or how far apart they are in the org chart? Contributors include: Jorge Aranda Tom Ball Victor R. Basili Andrew Begel Christian Bird Barry Boehm Marcelo Cataldo Steven Clarke Jason Cohen Robert DeLine Madeline Diep Hakan Erdogmus Michael Godfrey Mark Guzdial Jo E. Hannay Ahmed E. Hassan Israel Herraiz Kim Sebastian Herzig Cory Kapser Barbara Kitchenham Andrew Ko Lucas Layman Steve McConnell Tim Menzies Gail Murphy Nachi Nagappan Thomas J. Ostrand Dewayne Perry Marian Petre Lutz Prechelt Rahul Premraj Forrest Shull Beth Simon Diomidis Spinellis Neil Thomas Walter Tichy Burak Turhan Elaine J. Weyuker Michele A. Whitecraft Laurie Williams Wendy M. Williams Andreas Zeller Thomas Zimmermann", "book_id": "making_software", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2010-10-20", "subject_ids": ["computers_internet_programming_software_design_testing_engin"], "lcc_number": "", "isbn13": "9780596808327", "physical_description_text": "6.8\"x8.8\"x1.6\"; 1.8 lb; 624 pages", "title_latin": "Making Software", "author_data": [{"name": "Andy Oram", "id": "andy_oram"}, {"name": "Wilson, Greg", "id": "wilson_greg"}], "title": "Making Software", "shelf": "0"}