{"notes": "", "isbn10": "0596518382", "urls_text": "", "publisher_name": "O'Reilly Media, Inc", "topic": "style/technique", "dewey_normal": "5", "publisher_id": "oreilly_media_inc", "category": "practice", "language": "", "dewey_decimal": "005", "title_long": "Apprenticeship Patterns: Guidance for the Aspiring Software Craftsman", "publisher_text": "O'Reilly Media, Inc.", "summary": "Software developers face an ever-changing and ever-expanding technology landscape, which can appear as intimidating as Mt. Everest to newcomers. Developing technical skills is vital, but there are dozens of soft skills and learning techniques you need if you're to grow and succeed professionally. Honing those soft skills is a big part of what Apprenticeship Patterns is all about. Authors Dave Hoover and Adewale Oshineye, both formerly of the global IT consultancy ThoughtWorks, have cataloged dozens of patterns of behavior to help software developers hone their craft. Developed through years of research, a multitude of interviews, and feedback from O'Reilly's online forum, these patterns address difficult situations faced by entry-level programmers, system administrators, and database administrators. Each pattern has a memorable name to help point you in the right direction when you need it most. Examples of common obstacles and their solutions include: Burned out at work? Learn how to \"Nurture Your Passion\" by finding a pet project to help you rediscover the joy of problem solving Feeling overwhelmed by too much new information? Take a step back from your learning to re-explore some familiar territory by building something you've built before, then use \"Retreat Into Competence\" to launch yourself forward again Feeling stuck in your learning? Seek out a team of experienced and talented developers where you can \"Be the Worst\" for a while Like any patterns book, you can read this one front-to-back, jump to specific patterns when you encounter the issues they address, or cherry pick just the ones that are new to you. The purpose of the solutions is to inspire you to stay on the path you intend, rather than wander off into management because it seems like the only option for advancement. Apprenticeship Patterns approaches software development not as a means to financial success, but as a means to personal fulfillment. It's your life and your career. Discover how this book can help you make the best of both.", "book_id": "apprenticeship_patterns", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2009-11-15", "subject_ids": ["computers_internet_computer_science_software_engineering_gen", "computers_internet_computer_science_software_engineeri_aaaa0", "computers_internet_programming_languages_tools_general", "computers_internet_programming_languages_tools_general_aas", "computers_internet_programming_software_design_testing_engin", "computers_internet_programming_general", "computers_internet_programming_general_aas"], "lcc_number": "", "isbn13": "9780596518387", "physical_description_text": "150 pages", "title_latin": "Apprenticeship Patterns", "author_data": [{"name": "Dave Hoover", "id": "dave_hoover"}, {"name": "Adewale Oshineye", "id": "adewale_oshineye"}], "title": "Apprenticeship Patterns", "shelf": "2.3"}