{"notes": "Includes bibliographical references and index.\n\nCh. 0. Introduction -- Ch. 1. An Introduction to Little Languages -- Ch. 2. Designing a Little Language -- Ch. 3. Formal Considerations: Language and Grammars -- Ch. 4. Lexical Analysis and Parsing -- Ch. 5. The Architecture of a Language Processor -- Ch. 6. Nodes and Pointers: Data Structures for the Language Processor -- Ch. 7. Implementation of the Lexical Analyzer and Parser -- Ch. 8. lex and yacc -- Ch. 9. Executing the Translated Program: Interpretation and Compilation -- Ch. 10. Other Issues -- Appendix A. Data Structures -- Appendix B. Lexical Analyzer, Parser, Interpreter, and Compiler -- Appendix C. Instructions for Using the Source Code Disk.", "isbn10": "0471597538", "urls_text": "", "publisher_name": "Wiley", "topic": "language design", "dewey_normal": "5.45", "publisher_id": "wiley", "category": "low-level development", "language": "eng", "dewey_decimal": "005.4/5", "title_long": "", "publisher_text": "New York : Wiley, c1994.", "summary": "This unique book is an extremely practical, step-by-step guide to developing language processors. At the same time, it tells you everything you need to know to build, from scratch, custom-made little languages that will considerably streamline your programming chores. Long on nuts-and-bolts, hands-on guidance with just enough theory, the book is packed with specific real-world examples of all topics covered, and is organized around the design, development, debugging, and implementation of an interpreter and compiler to process a little language for storing, retrieving, and manipulating images. An excellent guide for seasoned programmers who need to develop special purpose languages and the processors needed to run whem, Constructing Language Processors for Little Languages is also a superior introduction to the basics of building compilers and interpreters for students and beginners.", "book_id": "constructing_language_processors_for_little_languages_a01", "copies": 1, "awards_text": "", "marc_enc_level": "", "edition_info": "(paper) :$39.95", "subject_ids": ["amazon_com_computers_internet_programming_languages_to_aaaa4", "amazon_com_computers_internet_programming_general", "compilers_computer_programs"], "lcc_number": "QA76.76", "isbn13": "9780471597537", "physical_description_text": "x, 452 p. : ill. ; 24 cm.", "title_latin": "Constructing language processors for little languages", "author_data": [{"name": "Kaplan, Randy M.", "id": "kaplan_randy_m"}], "title": "Constructing language processors for little languages", "shelf": "6.3"}