{"notes": "", "isbn10": "1593271743", "urls_text": "", "publisher_name": "No Starch Press", "topic": "style/technique", "dewey_normal": "5.14", "publisher_id": "no_starch_press", "category": "practice", "language": "", "dewey_decimal": "005.14", "title_long": "", "publisher_text": "No Starch Press", "summary": "Debugging is crucial to successful software development, but even many experienced programmers find it challenging. Sophisticated debugging tools are available, yet it may be difficult to determine which features are useful in which situations. The Art of Debugging is your guide to making the debugging process more efficient and effective. The Art of Debugging illustrates the use three of the most popular debugging tools on Linux/Unix platforms: GDB, DDD, and Eclipse. The text-command based GDB (the GNU Project Debugger) is included with most distributions. DDD is a popular GUI front end for GDB, while Eclipse provides a complete integrated development environment. In addition to offering specific advice for debugging with each tool, authors Norm Matloff and Pete Salzman cover general strategies for improving the process of finding and fixing coding errors, including how to: Inspect variables and data structures Understand segmentation faults and core dumps Know why your program crashes or throws exceptions Use features like catchpoints, convenience variables, and artificial arrays Avoid common debugging pitfalls Real world examples of coding errors help to clarify the authors' guiding principles, and coverage of complex topics like thread, client-server, GUI, and parallel programming debugging will make you even more proficient. You'll also learn how to prevent errors in the first place with text editors, compilers, error reporting, and static code checkers. Whether you dread the thought of debugging your programs or simply want to improve your current debugging efforts, you'll find a valuable ally in The Art of Debugging.", "book_id": "the_art_of_debugging_with_gdb_ddd_and_eclipse", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2008-09-29", "subject_ids": ["computers_internet_computer_science_software_engineeri_aaaa0", "computers_internet_programming_languages_tools_general", "computers_internet_programming_languages_tools_general_aas", "computers_internet_programming_software_design_testing_engin", "computers_internet_programming_software_design_testing_aaaa1", "computers_internet_software_general", "computers_internet_software_general_aas"], "lcc_number": "", "isbn13": "9781593271749", "physical_description_text": "6.9\"x9.2\"x0.9\"; 1.2 lb; 280 pages", "title_latin": "The Art of Debugging with GDB, DDD, and Eclipse", "author_data": [{"name": "Matloff, Norman S.", "id": "matloff_norman_s"}, {"name": "Peter Jay Salzman", "id": "peter_jay_salzman"}], "title": "The Art of Debugging with GDB, DDD, and Eclipse", "shelf": "2.3"}