{"notes": "", "isbn10": "188211485X", "urls_text": "", "publisher_name": "Free Software Foundation", "topic": "got to go", "dewey_normal": "0", "publisher_id": "free_software_foundation", "category": "stack", "language": "", "dewey_decimal": "", "title_long": "", "publisher_text": "Free Software Foundation", "summary": "GNU Emacs is much more than a simple word processor. Over the years it has expanded into an entire work flow environment. Programmers will be impressed by its integrated debugging and project management features. Emacs is also a multi-lingual word processor, can handle all your email and Usenet news needs, display web pages, and even has a diary and a calendar for your appointments! And when you tire of all the work you can accomplish with it, there are games to play. Features include: * Special editing modes for 25 programming languages including Java, Perl, C, C++, Objective C, Fortran, Lisp, Scheme, and Pascal. * Special scripting language modes for Bash, other common shells, and creating Makefiles for GNU/Linux, UNIX, Windows/DOS and VMS systems. * Support for typing and displaying in 21 non-English languages, including Chinese, Czech, Hindi, Hebrew, Russian, Vietnamese and all Western European languages. * Creates Postscript output from plain text files and has special editing modes for LaTeX and TeX * Compile and debug from inside Emacs * Maintain program ChangeLogs * Extensive file merge and diff functions * Directory navigation: flag, move and delete files and sub-directories recursively. * Run shell commands from inside Emacs, or even use Emacs as a shell itself (Eshell) * Set up tag tables * Version control management for release and beta versions, with CVS and RCS integration and much more! This book picks up where the introductory on-line tutorial included with Emacs ends. It explains the full range of Emacs' power and contains reference material useful to expert users. Appendixes with specific material for MacIntosh and Microsoft OS users are included.", "book_id": "gnu_emacs_manual_for_version_21_15th_edition", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2002-08-01", "subject_ids": [], "lcc_number": "", "isbn13": "9781882114856", "physical_description_text": "6.8\"x1.2\"x8.5\"; 644 pages; 2.2 lb", "title_latin": "GNU Emacs Manual, For Version 21, 15th Edition", "author_data": [{"name": "Stallman, Richard M.", "id": "stallman_richard_m"}], "title": "GNU Emacs Manual, For Version 21, 15th Edition", "shelf": "0"}