{"notes": "", "isbn10": "1593274351", "urls_text": "", "publisher_name": "No Starch Press", "topic": "erlang", "dewey_normal": "4", "publisher_id": "no_starch_press", "category": "languages", "language": "", "dewey_decimal": "004", "title_long": "Learn You Some Erlang for Great Good!: A Beginner's Guide", "publisher_text": "No Starch Press", "summary": "Erlang is the language of choice for programmers who want to write robust, concurrent applications, but its strange syntax and functional design can intimidate the uninitiated. Luckily, there's a new weapon in the battle against Erlang-phobia: Learn You Some Erlang for Great Good!Erlang maestro Fred Hebert starts slow and eases you into the basics: You'll learn about Erlang's unorthodox syntax, its data structures, its type system (or lack thereof!), and basic functional programming techniques. Once you've wrapped your head around the simple stuff, you'll tackle the real meat-and-potatoes of the language: concurrency, distributed computing, hot code loading, and all the other dark magic that makes Erlang such a hot topic among today's savvy developers.As you dive into Erlang's functional fantasy world, you'll learn about: Testing your applications with EUnit and Common Test Building and releasing your applications with the OTP framework Passing messages, raising errors, and starting/stopping processes over many nodes Storing and retrieving data using Mnesia and ETS Network programming with TCP, UDP, and the inet module The simple joys and potential pitfalls of writing distributed, concurrent applications Packed with lighthearted illustrations and just the right mix of offbeat and practical example programs, Learn You Some Erlang for Great Good! is the perfect entry point into the sometimes-crazy, always-thrilling world of Erlang.", "book_id": "learn_you_some_erlang_for_great_good", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2013-01-16", "subject_ids": ["computers_technology_programming_languages_tools", "computers_technology_programming_software_design_testi_aaaa0", "computers_technology_web_development_design_programming", "computers_technology_internet_web_culture", "education_reference"], "lcc_number": "", "isbn13": "9781593274351", "physical_description_text": "7.0\"x9.2\"x1.6\"; 2.6 lb; 624 pages", "title_latin": "Learn You Some Erlang for Great Good!", "author_data": [{"name": "Fred Hebert", "id": "fred_hebert"}], "title": "Learn You Some Erlang for Great Good!", "shelf": "?"}