{"notes": "", "isbn10": "1590593715", "urls_text": "", "publisher_name": "Apress", "topic": "python", "dewey_normal": "0", "publisher_id": "apress", "category": "languages", "language": "", "dewey_decimal": "", "title_long": "Foundations of Python Network Programming (Foundations)", "publisher_text": "Apress", "summary": "\"This may be the easiest book review I've ever written. If you program in Python and you want to write Internet applications, go buy Foundations of Python Network Programming by John Goerzen. There. What, you wanted more? Well, okay, but then I'm back to playing Katamari Damacy.\" &mdash; Ron Dippold, Slashdot contributor (Read the review on Slashdot.org) \"This book is 99% good, and the only reason that isn't 100% is due to the wide scope of the book. Which, then again, is also a good thing.\" &mdash; Tommi Virtansen, http://tv.debian.net To guide readers through the new scripting language, Python, this book discusses every aspect of client and server programming. And as Python begins to replace Perl as a favorite programming language, this book will benefit scripters and serious application developers who want a feature-rich, yet simple language, for deploying their products. The text explains multitasking network servers using several models, including forking, threading, and non-blocking sockets. Furthermore, the extensive examples demonstrate important concepts and practices, and provide a cadre of fully-functioning stand alone programs. Readers may even use the provided examples as building blocks to create their own software.", "book_id": "foundations_of_python_network_programming", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2004-08-17", "subject_ids": [], "lcc_number": "", "isbn13": "9781590593714", "physical_description_text": "7.1\"x9.3\"x1.1\"; 512 pages; 1.9 lb", "title_latin": "Foundations of Python Network Programming", "author_data": [{"name": "John Goerzen", "id": "john_goerzen"}], "title": "Foundations of Python Network Programming", "shelf": "8.1"}