{"notes": "", "isbn10": "1449381561", "urls_text": "", "publisher_name": "O'Reilly Media", "topic": "databases", "dewey_normal": "5", "publisher_id": "oreilly_media", "category": "low-level development", "language": "", "dewey_decimal": "005", "title_long": "", "publisher_text": "O'Reilly Media", "summary": "Discover how MongoDB can help you manage a huMONGOus amount of data collected through your web application. This book covers the basic principles and advanced uses of this document-oriented database, and demonstrates why MongoDB is one of the fastest-growing databases. Learn how MongoDB handles data as self-contained JSON-style documents, rather than as records in different relational database tables -- and why MongoDB is scalable, high-performance, and reliable. This authoritative introduction, written by two software engineers from the company that develops this open-source database, offers guidance for programmers and advanced configuration for system administrators. The opening chapters about concepts and use cases are ideal for others on the project. Explore the power and flexibility of document-oriented storage Learn to create, update, and delete documents in MongoDB Perform dynamic queries to find data with any criteria Learn advanced query techniques with aggregation tools and server-side scripting Get up to speed on security and authentication, backup and repair, and more Learn advanced configuration, such as replication and sharding Discover how to use MongoDB functions through real-world examples", "book_id": "mongodb_the_definitive_guide", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2010-09-15", "subject_ids": ["computers_internet_databases_general", "computers_internet_general"], "lcc_number": "", "isbn13": "9781449381561", "physical_description_text": "300 pages", "title_latin": "MongoDB: The Definitive Guide", "author_data": [{"name": "Michael Dirolf", "id": "michael_dirolf"}, {"name": "Kristina Chodorow", "id": "kristina_chodorow"}], "title": "MongoDB: The Definitive Guide", "shelf": "6.4"}