{"notes": "", "isbn10": "1558607021", "urls_text": "", "publisher_name": "Morgan Kaufmann", "topic": "software design", "dewey_normal": "0", "publisher_id": "morgan_kaufmann", "category": "practice", "language": "", "dewey_decimal": "", "title_long": "", "publisher_text": "Morgan Kaufmann", "summary": "Embedded system designers are constantly looking for new tools and techniques to help satisfy the exploding demand for consumer information appliances and specialized industrial products. One critical barrier to the timely release of embedded system products is integrating the design of the hardware and software systems. Hardware/software co-design is a set of methodologies and techniques specifically created to support the concurrent design of both systems, effectively reducing multiple iterations and major redesigns. In addition to its critical role in the development of embedded systems, many experts believe that co-design will be a key design methodology for Systems-on-a-Chip.Readings in Hardware/Software Co-Design presents the papers that have shaped the hardware/software co-design field since its inception in the early 90s. Field experts -- Giovanni De Micheli, Rolf Ernst, and Wayne Wolf -- introduce sections of the book, and provide context for the paper that follow. This collection provides professionals, researchers and graduate students with a single reference source for this critical aspect of computing design.* Over 50 peer-reviewed papers written from leading researchers and designers in the field* Selected, edited, and introduced by three of the fields' most eminent researchers and educators* Accompanied by an annually updated companion Web site with links and references to recently published papers, providing a forum for the editors to comment on how recent work continues or breaks with previous work in the field", "book_id": "readings_in_hardware_software_co_design", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2001-06-01", "subject_ids": ["amazon_com_computers_internet_programming_software_des_aaaa0", "amazon_com_reference_general"], "lcc_number": "", "isbn13": "9781558607026", "physical_description_text": "8.6\"x11.0\"x1.2\"; 697 pages; 3.0 lb", "title_latin": "Readings in Hardware/Software Co-design", "author_data": [{"name": "Giovanni De Micheli", "id": "giovanni_de_micheli"}, {"name": "Rolf Ernst", "id": "rolf_ernst"}, {"name": "Wolf, Wayne R.", "id": "wolf_wayne_r"}], "title": "Readings in Hardware/Software Co-design", "shelf": "2.2"}