{"notes": "", "isbn10": "1430223634", "urls_text": "", "publisher_name": "Apress", "topic": "ruby", "dewey_normal": "5", "publisher_id": "apress", "category": "languages", "language": "", "dewey_decimal": "005", "title_long": "Beginning Ruby: From Novice to Professional, Second Edition (Beginning from Novice to Professional)", "publisher_text": "Apress", "summary": "Based on the best-selling first edition, Beginning Ruby: From Novice to Professional, Second Edition is the leading guide for every type of reader who wants to learn Ruby from the ground up. The new edition of this book provides the same excellent introduction to Ruby as the first edition plus updates for the newest version of Ruby, including the addition of the Sinatra and Ramaze web application frameworks and a chapter on GUI development so developers can take advantage of these new trends. Beginning Ruby starts by explaining the principles behind object-oriented programming and within a few chapters builds toward creating a full Ruby application. By the end of the book, in addition to in-depth knowledge of Ruby, you'll also have basic understanding of many ancillary technologies such as SQL, XML, web frameworks, and networking. Introduces readers to the Ruby programming language Takes readers from basic programming skills to web development with topics like Ruby-based frameworks and GUI programming Covers many ancillary technologies in order to provide a broader picture (e.g., databases, XML, network daemons) What you'll learn Understand the basics of Ruby and object-oriented building blocks. Work with Ruby libraries, gems, and documentation. Work with files and databases. Write and deploy Ruby applications. Explore Ruby web frameworks and aspects of network programming with Ruby. Develop desktop and GUI applications with Ruby. Who is this book for? Beginning programmers, programmers new to Ruby, and web developers interested in knowing the foundations of the language", "book_id": "beginning_ruby_from_novice_to_professional_second_edition", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2009-07-20", "subject_ids": ["computers_internet_programming_languages_tools_general", "computers_internet_programming_languages_tools_general_aas", "computers_internet_programming_software_design_testing_engin", "computers_internet_programming_general", "computers_internet_programming_general_aas"], "lcc_number": "", "isbn13": "9781430223634", "physical_description_text": "700 pages", "title_latin": "Beginning Ruby: From Novice to Professional, Second Edition", "author_data": [{"name": "Cooper, Peter", "id": "cooper_peter"}], "title": "Beginning Ruby: From Novice to Professional, Second Edition", "shelf": "8.3"}