{"notes": "", "isbn10": "1568984650", "urls_text": "", "publisher_name": "Princeton Architectural Press", "topic": "design", "dewey_normal": "0", "publisher_id": "princeton_architectural_press", "category": "other subjects", "language": "", "dewey_decimal": "", "title_long": "Grid Systems: Principles of Organizing Type", "publisher_text": "Princeton Architectural Press", "summary": "Although grid systems are the foundation for almost all typographic design, they are often associated with rigid, formulaic solutions. However, the belief that all great design is nonetheless based on grid systems (even if only subverted ones) suggests that few designers truly understand the complexities and potential riches of grid composition. In her best-selling Geometry of Design, Elam shows how proportion, symmetry, and other geometrical systems underlie many of the visual relationships that make for good design. Now, Elam brings the same keen eye and clear explanations to bear on the most prevalent, and maybe least understood, system of visual organization: the grid. Filled with extensive research and more than 100 informative examples from the Bauhaus to Nike ads, Grid Systems provides a rich, easy-to-understand overview and demonstrates a step-by-step approach to typographic composition. It suggests design strategies that transcend simple function and reductionist recipes to allow grids to become a means of truly dynamic communication. Any designer, educator, or student will benefit greatly from this elegant slim book, chock-a-block full of colorful examples, helpful vellum overlays, and Elam's insightful analysis.", "book_id": "grid_systems", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2004-08", "subject_ids": ["amazon_com_professional_technical_architecture_general", "amazon_com_arts_photography_graphic_design_graphic_arts_gene", "amazon_com_arts_photography_graphic_design_typography"], "lcc_number": "", "isbn13": "9781568984650", "physical_description_text": "7.0\"x8.5\"x0.5\"; 112 pages; 0.9 lb", "title_latin": "Grid Systems", "author_data": [{"name": "Elam, Kimberly", "id": "elam_kimberly"}], "title": "Grid Systems", "shelf": "3.2"}