{"notes": "", "isbn10": "193435662X", "urls_text": "", "publisher_name": "Pragmatic Bookshelf", "topic": "embedded systems", "dewey_normal": "5", "publisher_id": "pragmatic_bookshelf", "category": "low-level development", "language": "", "dewey_decimal": "005", "title_long": "", "publisher_text": "Pragmatic Bookshelf", "summary": "Did you write C code last week? Does your code work? Is your design clean? If you answered yes to the first question but got queasy over the second two, you need to know about Test Driven Development. TDD helps you write code that works the first time, and then helps you keep it running as the code evolves to meet new needs. In Test Driven Development for Embedded C, author James W. Grenning shows embedded software developers how to bring the benefits of TDD to embedded C. In the book, you'll see how to apply TDD to C and the world of embedded software development. Learn how to break key dependencies, allowing code to be tested thoroughly. Explore how to test-drive your product's core logic, exploiting the power of your development environment to deliver better software. In fact, as the book shows, you can test-drive a device driver before you even have the device soldered into a circuit board. Avoid the natural delays when testing on the target by using the tailored TDD Microcycle, employing off-target tests and dual-targeted code. Learn how to make code testable and more flexible, better able to handle the inevitable changes demanded by the market. The tests drive development and then serve as an executable specification, keeping track of the critical details and assumptions baked into the code. In Test Driven Development for Embedded C, you'll find that TDD is a different way to program-unit tests are written in a tight feedback loop with the production code, producing testable code and greatly reducing wasteful debugging. TDD also influences design. When tests are considered part of design, you create modular and loosely coupled code, the hallmarks of a good design. With Test Driven Development for Embedded C, C developers-even embedded C developers-can finally write cleaner, testable code with TDD.", "book_id": "test_driven_development_for_embedded_c", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2010-11-25", "subject_ids": ["computers_internet_programming_software_design_testing_engin", "computers_internet_programming_software_design_testing_aaaa1"], "lcc_number": "", "isbn13": "9781934356623", "physical_description_text": "310 pages", "title_latin": "Test Driven Development for Embedded C", "author_data": [{"name": "James W. Grenning", "id": "james_w_grenning"}], "title": "Test Driven Development for Embedded C", "shelf": "6.1"}