{"notes": "", "isbn10": "1449304230", "urls_text": "", "publisher_name": "O'Reilly Media", "topic": "ruby", "dewey_normal": "5", "publisher_id": "oreilly_media", "category": "languages", "language": "", "dewey_decimal": "005", "title_long": "", "publisher_text": "O'Reilly Media", "summary": "Take advantage of Sinatra, the Ruby-based web application library and domain-specific language used by GitHub, LinkedIn, Engine Yard, and other prominent organizations. With this concise book, you will quickly gain working knowledge of Sinatra and its minimalist approach to building both standalone and modular web applications.Sinatra serves as a lightweight wrapper around Rack middleware, with syntax that maps closely to functions exposed by HTTP verbs, which makes it ideal for web services and APIs. If you have experience building applications with Ruby, you'll quickly learn language fundamentals and see under-the-hood techniques, with the help of several practical examples. Then you'll get hands-on experience with Sinatra by building your own blog engine.Learn Sinatra's core concepts, and get started by building a simple applicationCreate views, manage sessions, and work with Sinatra route definitionsBecome familiar with the language's internals, and take a closer look at RackUse different subclass methods for building flexible and robust architecturesPut Sinatra to work: build a blog that takes advantage of service hooks provided by the GitHub API", "book_id": "sinatra_up_and_running", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2011-12-01", "subject_ids": ["computers_technology_programming_languages_tools"], "lcc_number": "", "isbn13": "9781449304232", "physical_description_text": "7.0\"x9.1\"x0.3\"; 0.5 lb; 120 pages", "title_latin": "Sinatra: Up and Running", "author_data": [{"name": "Harris, Alan Edward", "id": "harris_alan_edward"}, {"name": "Haase, Konstantin", "id": "haase_konstantin"}], "title": "Sinatra: Up and Running", "shelf": "8.4"}