{"notes": "", "isbn10": "1118026691", "urls_text": "", "publisher_name": "Wrox", "topic": "javascript", "dewey_normal": "5", "publisher_id": "wrox", "category": "languages", "language": "", "dewey_decimal": "005", "title_long": "", "publisher_text": "Wrox", "summary": "A significant update to a bestselling JavaScript bookAs the key scripting language for the web, JavaScript is supported by every modern web browser and allows developers to create client-side scripts that take advantage of features such as animating the canvas tag and enabling client-side storage and application caches. After an in-depth introduction to the JavaScript language, this updated edition of a bestseller progresses to break down how JavaScript is applied for web development using the latest web development technologies. Veteran author and JavaScript guru Nicholas Zakas shows how JavaScript works with the new HTML5 as well as other significant advances in web development as it relates to JavaScript.Begins with an introduction to JavaScript basics and then moves on to more advanced topics regarding JavaScript and advances in web development technologiesDescribes how JavaScript is implemented into HTML5Covers browser/feature detection in scripts, event-driven JavaScript development, error reporting and debugging, offline application and data storage, and moreProfessional JavaScript for Web Developers, 3rd Edition is an authoritative JavaScript resource that every web developers should have.", "book_id": "professional_javascript_for_web_developers_a03", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2012-01-18", "subject_ids": ["computers_technology_programming_languages_tools", "computers_technology_web_development_web_design", "computers_technology_web_development_programming"], "lcc_number": "", "isbn13": "9781118026694", "physical_description_text": "7.3\"x9.2\"x1.5\"; 3.5 lb; 960 pages", "title_latin": "Professional JavaScript for Web Developers", "author_data": [{"name": "Nicholas C. Zakas", "id": "nicholas_c_zakas"}], "title": "Professional JavaScript for Web Developers", "shelf": "5.3"}