{"notes": "", "isbn10": "1880685426", "urls_text": "", "publisher_name": "Two Plus Two Publishing LLC", "topic": "games", "dewey_normal": "795", "publisher_id": "two_plus_two_publishing_llc", "category": "other subjects", "language": "", "dewey_decimal": "795", "title_long": "How to Play No-Limit Hold 'em Cash Games (Harrington on Cash Games, Vol. 1)", "publisher_text": "Two Plus Two Publishing LLC", "summary": "The first years of the poker boom were fueled by the interest in no-limit hold em tournaments. Recently, however, players have been gravitating to another, even more complex form of hold em no-limit cash games. In Harrington on Cash Games: Volume I, Dan Harrington teaches you the key concepts that drive deep-stack cash game play. You ll learn how to tailor your selection of starting hands to your stack size, how to recognize the increasing deception value of supposedly weaker hands as the stack sizes increase, and how to use the concept of pot commitment to your advantage as the size of the pot grows. After laying out the general concepts behind deep-stack cash game play, Harrington shows you a complete strategy for post-flop play, and then teaches you the difference between post-flop play against a single opponent and post-flop play against multiple opponents. If you play no-limit hold em cash games, you need to read this book. Dan Harrington won the gold bracelet and the World Champion title at the $10,000 buy-in No-Limit Hold em Championship at the 1995 World Series of Poker. And he was the only player to make the final table in 2003 (field of 839) and 2004 (field of 2,576) considered by cognoscenti to be the greatest accomplishment in WSOP history. In Harrington on Cash Games, Harrington and two-time World Backgammon Champion Bill Robertie have written the definitive books on no-limit cash games. These books will teach you what you need to know to be a winner in the cash game world.", "book_id": "how_to_play_no_limit_hold_em_cash_games", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2008-03-14", "subject_ids": [], "lcc_number": "", "isbn13": "9781880685426", "physical_description_text": "418 pages", "title_latin": "How to Play No-Limit Hold 'em Cash Games", "author_data": [{"name": "Dan Harrington", "id": "dan_harrington"}, {"name": "Robertie, Bill", "id": "robertie_bill"}], "title": "How to Play No-Limit Hold 'em Cash Games", "shelf": "1.1"}