{"notes": "", "isbn10": "1479274836", "urls_text": "", "publisher_name": "CreateSpace Independent Publishing Platform", "topic": "interview", "dewey_normal": "650", "publisher_id": "createspace_independent_publis", "category": "jobs", "language": "", "dewey_decimal": "650", "title_long": "", "publisher_text": "CreateSpace Independent Publishing Platform", "summary": "Have you ever... Wanted to work at an exciting futuristic company? Struggled with an interview problem that could have been solved in 15 minutes? Wished you could study real-world computing problems? If so, you need to read Elements of Programming Interviews (EPI). The core of EPI is a collection of 300 problems with detailed solutions, including over 100 figures and 200 tested programs. The problems are challenging, well-motivated, and accessible. They are representative of the questions asked at interviews at the most exciting companies. The book begins with a summary of patterns for data structure, algorithms, and problem solving that will help you solve the most challenging interview problems. This is followed by chapters on basic and advanced data structures, algorithm design, concurrency, system design, probability and discrete mathematics. Each chapter starts with a brief review of key concepts and results followed by a deep and wide set of questions. EPI concludes with a summary of the nontechnical aspects of interviewing, including common mistakes, strategies for a great interview, perspectives from across the table, negotiating the best offer, and much more. \"This book is the best compilation of programming related problems I have seen. It is a great resource for a diverse set of topics when preparing for technical interviews, as a quick refresher in a subject area or when you are just looking for a brain teaser to challenge yourself.\" Shashank Gupta / Scaligent, formerly Engineering Manager, Amazon.com, Senior Engineering Manager, Yahoo!, Manager of Software Development, Cisco Systems", "book_id": "elements_of_programming_interviews", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2012-10-11", "subject_ids": ["business_investing_job_hunting_careers_job_hunting"], "lcc_number": "", "isbn13": "9781479274833", "physical_description_text": "6.2\"x9.4\"x1.1\"; 1.4 lb; 458 pages", "title_latin": "Elements of Programming Interviews", "author_data": [{"name": "Aziz, Adnan", "id": "aziz_adnan"}, {"name": "Prakash, Amit", "id": "prakash_amit"}, {"name": "Tsung-Hsien Lee", "id": "tsung_hsien_lee"}], "title": "Elements of Programming Interviews", "shelf": "9.4"}