{"notes": "", "isbn10": "1584889454", "urls_text": "", "publisher_name": "Chapman and Hall/CRC", "topic": "algorithms", "dewey_normal": "5.275", "publisher_id": "chapman_and_hall_crc", "category": "theory", "language": "", "dewey_decimal": "005.275", "title_long": "Parallel Algorithms (Chapman and Hall/CRC Numerical Analy and Scient Comp. Series)", "publisher_text": "Chapman and Hall/CRC", "summary": "Focusing on algorithms for distributed-memory parallel architectures, Parallel Algorithms presents a rigorous yet accessible treatment of theoretical models of parallel computation, parallel algorithm design for homogeneous and heterogeneous platforms, complexity and performance analysis, and essential notions of scheduling. The book extracts fundamental ideas and algorithmic principles from the mass of parallel algorithm expertise and practical implementations developed over the last few decades. In the first section of the text, the authors cover two classical theoretical models of parallel computation (PRAMs and sorting networks), describe network models for topology and performance, and define several classical communication primitives. The next part deals with parallel algorithms on ring and grid logical topologies as well as the issue of load balancing on heterogeneous computing platforms. The final section presents basic results and approaches for common scheduling problems that arise when developing parallel algorithms. It also discusses advanced scheduling topics, such as divisible load scheduling and steady-state scheduling. With numerous examples and exercises in each chapter, this text encompasses both the theoretical foundations of parallel algorithms and practical parallel algorithm design.", "book_id": "parallel_algorithms_a03", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Hardcover; 2008-07-17", "subject_ids": ["computers_internet_hardware_parallel_processing_computers", "computers_internet_programming_algorithms_general", "professional_technical_professional_science_mathematics_numb", "science_mathematics_number_systems", "science_mathematics_general", "science_general_aaaa0"], "lcc_number": "", "isbn13": "9781584889458", "physical_description_text": "6.4\"x9.1\"x1.0\"; 1.5 lb; 360 pages", "title_latin": "Parallel Algorithms", "author_data": [{"name": "Henri Casanova", "id": "henri_casanova"}, {"name": "Arnaud Legrand", "id": "arnaud_legrand"}, {"name": "Robert, Yves", "id": "robert_yves"}], "title": "Parallel Algorithms", "shelf": "4.4"}