{"notes": "", "isbn10": "1441919015", "urls_text": "", "publisher_name": "Springer New York", "topic": "algorithms", "dewey_normal": "0", "publisher_id": "springer_new_york_a01", "category": "theory", "language": "", "dewey_decimal": "", "title_long": "Parsing Techniques: A Practical Guide", "publisher_text": "Springer New York", "summary": "Parsing, also referred to as syntax analysis, has been and continues to be an essential part of computer science and linguistics. Today, parsing techniques are also implemented in a number of other disciplines, including but not limited to, document preparation and conversion, typesetting chemical formulae, and chromosome recognition. This second edition presents new developments and discoveries that have been made in the field. Parsing techniques have grown considerably in importance, both in computational linguistics where such parsers are the only option, and computer science, where advanced compilers often use general CF parsers. Parsing techniques provide a solid basis for compiler construction and contribute to all existing software: enabling Web browsers to analyze HTML pages and PostScript printers to analyze PostScript. Some of the more advanced techniques are used in code generation in compilers and in data compression. In linguistics, the importance of formal grammars was recognized early on, but only recently have the corresponding parsing techniques been applied. Also their importance as general pattern recognizers is slowly being acknowledged. This text Parsing Techniques explores new developments, such as generalized deterministic parsing, linear-time substring parsing, parallel parsing, parsing as intersection, non-canonical methods, and non-Chomsky systems. To provide readers with low-threshold access to the full field of parsing techniques, this new edition uses a two-tiered structure. The basic ideas behind the dozen or so existing parsing techniques are explained in an intuitive and narrative style, and problems are presented at the conclusion of each chapter, allowing the reader to step outside the bounds of the covered material and explore parsing techniques at various levels. The reader is also provided with an extensive annotated bibliography as well as hints and partial solutions to a number of problems. In the bibliography, hundreds of realizations and improvements of parsing techniques are explained in a much terser, yet still informal, style, improving its readability and usability. The reader should have an understanding of algorithmic thinking, especially recursion; however, knowledge of any particular programming language is not required.", "book_id": "parsing_techniques_a02", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2009-12-28", "subject_ids": [], "lcc_number": "", "isbn13": "9781441919014", "physical_description_text": "5.9\"x8.6\"x1.8\"; 2.3 lb; 688 pages", "title_latin": "Parsing Techniques", "author_data": [{"name": "Grune, Dick", "id": "grune_dick"}], "title": "Parsing Techniques", "shelf": "4.4"}