{"notes": "", "isbn10": "1933988657", "urls_text": "", "publisher_name": "Manning Publications", "topic": "ruby", "dewey_normal": "5", "publisher_id": "manning_publications", "category": "languages", "language": "", "dewey_decimal": "005", "title_long": "", "publisher_text": "Manning Publications", "summary": "The Well-Grounded Rubyist takes you from interested novice to proficient practitioner. It's a beautifully written tutorial that begins with the basic steps to get your first Ruby program up and running and goes on to explore sophisticated topics like callable objects, reflection, and threading. Whether the topic is simple or tough, the book's easy-to-follow examples and explanations will give you immediate confidence as you build your Ruby programming skills. The Well-Grounded Rubyist is a thoroughly revised and updated edition of the best-selling Ruby for Rails. In this new book, expert author David A. Black moves beyond Rails and presents a broader view of Ruby. It covers Ruby 1.9, and keeps the same sharp focus and clear writing that made Ruby for Rails stand out. Starting with the basics, The Well-Grounded Rubyist explains Ruby objects and their interactions from the ground up. In the middle chapters, the book turns to an examination of Ruby's built-in, core classes, showing the reader how to manipulate strings, numbers, arrays, ranges, hashes, sets, and more. Regular expressions get attention, as do file and other I/O operations. Along the way, the reader is introduced to numerous tools included in the standard Ruby distribution--tools like the task manager Rake and the interactive Ruby console-based interpreter Irb--that facilitate Ruby development and make it an integrated and pleasant experience. The book encompasses advanced topics, like the design of Ruby's class and module system, and the use of Ruby threads, taking even the new Rubyist deep into the language and giving every reader the foundations necessary to use, explore, and enjoy this unusually popular and versatile language. It's no wonder one reader commented: \"The technical depth is just right to not distract beginners, yet detailed enough for more advanced readers.\"", "book_id": "the_well_grounded_rubyist", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2009-04-28", "subject_ids": ["computers_internet_home_computing_internet_general", "computers_internet_computer_science_software_engineering_gen", "computers_internet_computer_science_software_engineeri_aaaa0", "computers_internet_databases_general", "computers_internet_databases_general_aas", "computers_internet_networking_networks_protocols_apis_genera", "computers_internet_networking_networks_protocols_apis__aaaa0", "computers_internet_networking_general", "computers_internet_programming_languages_tools_general", "computers_internet_programming_languages_tools_general_aas", "computers_internet_programming_software_design_testing_engin", "computers_internet_programming_general", "computers_internet_programming_general_aas", "computers_internet_software_general", "computers_internet_software_general_aas", "computers_internet_web_development_web_services", "computers_internet_general", "computers_internet_general_aas"], "lcc_number": "", "isbn13": "9781933988658", "physical_description_text": "525 pages", "title_latin": "The Well-Grounded Rubyist", "author_data": [{"name": "Black, David St Clair", "id": "black_david_st_clair"}], "title": "The Well-Grounded Rubyist", "shelf": "8.4"}