{"notes": "", "isbn10": "1849960941", "urls_text": "", "publisher_name": "Springer", "topic": "databases", "dewey_normal": "4", "publisher_id": "springer", "category": "low-level development", "language": "", "dewey_decimal": "004", "title_long": "Introduction to Databases: From Biological to Spatio-Temporal (Texts in Computer Science)", "publisher_text": "Springer", "summary": "This textbook reveals the workings of numerous database systems, enabling readers to develop complex database applications. Students will gain hands-on experience by following the exercises. The theory is complemented by detailed examination of specific applications from a broad range of areas. The text assumes only basic discrete mathematics, linear algebra, and programming knowledge. Features: Provides descriptions of 11 types of databases, and 2 database systems; Concludes each chapter with bibliographic notes and exercises; Examines database design, including issues of database interoperability, data integration, interpolation and approximation, and prediction and data mining; Presents course aids at a supporting website; Covers topics on indexing methods, data visualization, the safety of queries, general evaluation algorithms, the efficient implementation of evaluation algorithms, and the complexity of the evaluation of different types of queries; Structured to allow for flexible course design.", "book_id": "introduction_to_databases_from_biological_to_spatio_temporal", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Hardcover; 2009-12-18", "subject_ids": ["computers_internet_computer_science_artificial_intelli_aaab2", "computers_internet_databases_beginning_introductory", "computers_internet_databases_general", "computers_internet_programming_general", "computers_internet_general"], "lcc_number": "", "isbn13": "9781849960946", "physical_description_text": "754 pages", "title_latin": "Introduction to Databases: From Biological to Spatio-Temporal", "author_data": [{"name": "Revesz, Peter", "id": "revesz_peter"}], "title": "Introduction to Databases: From Biological to Spatio-Temporal", "shelf": "6.4"}