{"notes": "", "isbn10": "1565920015", "urls_text": "", "publisher_name": "O'Reilly", "topic": "operating systems", "dewey_normal": "0", "publisher_id": "oreilly", "category": "platforms", "language": "", "dewey_decimal": "", "title_long": "Unix in a Nutshell: System V & Solaris 2.0", "publisher_text": "O'Reilly", "summary": "Simply the best System V and Solaris reference on the market today, Unix in a Nutshell won't steer you wrong. The book's concise style delivers the essential information on Unix, shell, and utility commands. Its command documentation is clear and complete and its examples are relevant and easy to follow. Gilly starts with a complete, alphabetized listing of core Unix commands. Each entry includes a syntax summary, a clear statement of what the command does, and a full list of options, each with commentary on its function. The author then covers shell documentation, supplying details on the Bourne, Korn, and C shells and documenting each shell's commands in the standard format. Gilly also includes a section on regular expressions as they apply to grep, egrep, text editors, and various scripting languages. Next, the book offers complete documentation of Emacs, ex, and vi, the powerful editors whose command structure proves perennially difficult to learn. The commands, once again, appear alphabetically with statements of their respective purposes. Other popular utilities--sed, awk, nroff, troff, tbl, and several macro languages--follow. Code managers SCCS and RCS, rarely documented in Unix books, bring up the rear. Users need to know what they're looking up or they won't find this book useful. Otherwise, Unix in a Nutshell's documentation is the best. --David Wall", "book_id": "unix_in_a_nutshell_a01", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 1995", "subject_ids": [], "lcc_number": "", "isbn13": "9781565920019", "physical_description_text": "444 pages", "title_latin": "Unix in a Nutshell", "author_data": [{"name": "Gilly, Daniel", "id": "gilly_daniel"}, {"name": "The staff of O'Reilly Media", "id": "the_staff_of_oreilly_media"}], "title": "Unix in a Nutshell", "shelf": "9.4"}