{"notes": "", "isbn10": "1584889780", "urls_text": "", "publisher_name": "Chapman & Hall/CRC", "topic": "algorithms", "dewey_normal": "518", "publisher_id": "chapman_hall_crc", "category": "theory", "language": "", "dewey_decimal": "518", "title_long": "Numerical Linear Approximation in C (Chapman & Hall/Crc Numerical Analysis & Scientific Computing)", "publisher_text": "Chapman & Hall/CRC", "summary": "Illustrating the relevance of linear approximation in a variety of fields, Numerical Linear Approximation in C presents a unique collection of linear approximation algorithms that can be used to analyze, model, and compress discrete data. Developed by the lead author, the algorithms have been successfully applied to several engineering projects at the National Research Council of Canada. Basing most of the algorithms on linear programming techniques, the book begins with an introductory section that covers applications, the simplex method, and matrices. The next three parts focus on various L1, Chebyshev, and least squares approximations, including one-sided, bounded variables, and piecewise. The final section presents the solution of underdetermined systems of consistent linear equations that are subject to different constraints on the elements of the unknown solution vector. Except in the preliminary section, all chapters include the C functions of the algorithms, along with drivers that contain numerous test case examples and results. The accompanying CD-ROM also provides the algorithms written in C code as well as the test drivers. To use the software, it is not required to understand the theory behind each function.", "book_id": "numerical_linear_approximation_in_c", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Hardcover; 2008-05-19", "subject_ids": ["science_mathematics_number_systems", "professional_technical_professional_science_mathematics_numb"], "lcc_number": "", "isbn13": "9781584889786", "physical_description_text": "6.1\"x9.3\"x2.0\"; 3.2 lb; 968 pages", "title_latin": "Numerical Linear Approximation in C", "author_data": [{"name": "Nabih Abdelmalek", "id": "nabih_abdelmalek"}, {"name": "William Malek", "id": "william_malek"}], "title": "Numerical Linear Approximation in C", "shelf": "4.2"}