{"notes": "", "isbn10": "1449389554", "urls_text": "", "publisher_name": "O'Reilly Media", "topic": "philosophy/commentary", "dewey_normal": "5", "publisher_id": "oreilly_media", "category": "other subjects", "language": "", "dewey_decimal": "005", "title_long": "Hackers & Painters: Big Ideas from the Computer Age", "publisher_text": "O'Reilly Media", "summary": "\"The computer world is like an intellectual Wild West, in which you can shoot anyone you wish with your ideas, if you're willing to risk the consequences. \" --from Hackers & Painters: Big Ideas from the Computer Age, by Paul Graham We are living in the computer age, in a world increasingly designed and engineered by computer programmers and software designers, by people who call themselves hackers. Who are these people, what motivates them, and why should you care? Consider these facts: Everything around us is turning into computers. Your typewriter is gone, replaced by a computer. Your phone has turned into a computer. So has your camera. Soon your TV will. Your car was not only designed on computers, but has more processing power in it than a room-sized mainframe did in 1970. Letters, encyclopedias, newspapers, and even your local store are being replaced by the Internet. Hackers & Painters: Big Ideas from the Computer Age, by Paul Graham, explains this world and the motivations of the people who occupy it. In clear, thoughtful prose that draws on illuminating historical examples, Graham takes readers on an unflinching exploration into what he calls \"an intellectual Wild West.\" The ideas discussed in this book will have a powerful and lasting impact on how we think, how we work, how we develop technology, and how we live. Topics include the importance of beauty in software design, how to make wealth, heresy and free speech, the programming language renaissance, the open-source movement, digital design, internet startups, and more.", "book_id": "hackers_painters_a01", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2010-05-01", "subject_ids": ["computers_internet_business_culture_hacking", "computers_internet_business_culture_privacy", "computers_internet_computer_science_information_theory", "computers_internet_networking_networks_protocols_apis_genera", "computers_internet_networking_network_security", "computers_internet_operating_systems_linux_general", "computers_internet_programming_algorithms_general", "computers_internet_general"], "lcc_number": "", "isbn13": "9781449389550", "physical_description_text": "5.5\"x8.6\"x0.8\"; 0.7 lb; 272 pages", "title_latin": "Hackers & Painters", "author_data": [{"name": "Graham, Paul", "id": "graham_paul"}], "title": "Hackers & Painters", "shelf": "1.4"}