{"notes": "", "isbn10": "1933988312", "urls_text": "", "publisher_name": "Manning Publications", "topic": "applied", "dewey_normal": "4", "publisher_id": "manning_publications", "category": "ai", "language": "", "dewey_decimal": "004", "title_long": "", "publisher_text": "Manning Publications", "summary": "There's a great deal of wisdom in a crowd, but how do you listen to a thousand people talking at once? Identifying the wants, needs, and knowledge of internet users can be like listening to a mob. In the Web 2.0 era, leveraging the collective power of user contributions, interactions, and feedback is the key to market dominance. A new category of powerful programming techniques lets you discover the patterns, inter-relationships, and individual profiles-the collective intelligence--locked in the data people leave behind as they surf websites, post blogs, and interact with other users. Collective Intelligence in Action is a hands-on guidebook for implementing collective intelligence concepts using Java. It is the first Java-based book to emphasize the underlying algorithms and technical implementation of vital data gathering and mining techniques like analyzing trends, discovering relationships, and making predictions. It provides a pragmatic approach to personalization by combining content-based analysis with collaborative approaches. This book is for Java developers implementing Collective Intelligence in real, high-use applications. Following a running example in which you harvest and use information from blogs, you learn to develop software that you can embed in your own applications. The code examples are immediately reusable and give the Java developer a working collective intelligence toolkit. Along the way, you work with, a number of APIs and open-source toolkits including text analysis and search using Lucene, web-crawling using Nutch, and applying machine learning algorithms using WEKA and the Java Data Mining (JDM) standard.", "book_id": "collective_intelligence_in_action", "copies": 1, "awards_text": "", "marc_enc_level": "~", "edition_info": "Paperback; 2008-10-28", "subject_ids": ["computers_internet_home_computing_internet_general_aas", "computers_internet_computer_science_artificial_intelligence_", "computers_internet_computer_science_artificial_intelli_aaaa8", "computers_internet_computer_science_artificial_intelli_aaaa6", "computers_internet_computer_science_artificial_intelli_aaaa3", "computers_internet_computer_science_information_theory", "computers_internet_databases_data_mining", "computers_internet_programming_algorithms_general", "computers_internet_programming_general", "computers_internet_software_general", "computers_internet_web_development_programming_general", "computers_internet_web_development_web_services", "computers_internet_web_development_general_aas", "computers_internet_general"], "lcc_number": "", "isbn13": "9781933988313", "physical_description_text": "7.3\"x9.2\"x1.0\"; 1.5 lb; 425 pages", "title_latin": "Collective Intelligence in Action", "author_data": [{"name": "Satnam Alag", "id": "satnam_alag"}], "title": "Collective Intelligence in Action", "shelf": "7.3"}